{
  "architectures": [
    "GlmMoeDsaForCausalLM"
  ],
  "attention_dropout": 0.0,
  "first_k_dense_replace": 3,
  "head_dim": 192,
  "hidden_act": "silu",
  "hidden_size": 6144,
  "index_head_dim": 128,
  "index_n_heads": 32,
  "index_share_for_mtp_iteration": true,
  "index_skip_topk_offset": 3,
  "index_topk": 2048,
  "index_topk_freq": 4,
  "indexer_rope_interleave": true,
  "indexer_types": ["full", "full", "full", "shared", "shared", "shared", "full", "shared"],
  "intermediate_size": 12288,
  "kv_lora_rank": 512,
  "max_position_embeddings": 1048576,
  "mlp_layer_types": ["dense", "dense", "dense", "sparse", "sparse", "sparse", "sparse", "sparse"],
  "model_type": "glm_moe_dsa",
  "moe_intermediate_size": 2048,
  "moe_layer_freq": 1,
  "n_routed_experts": 256,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 64,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 8,
  "num_key_value_heads": 64,
  "num_nextn_predict_layers": 1,
  "q_lora_rank": 2048,
  "qk_head_dim": 256,
  "qk_nope_head_dim": 192,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-05,
  "rope_interleave": true,
  "rope_parameters": {
    "rope_theta": 8000000,
    "rope_type": "default"
  },
  "routed_scaling_factor": 2.5,
  "scoring_func": "sigmoid",
  "topk_group": 1,
  "topk_method": "noaux_tc",
  "v_head_dim": 256,
  "vocab_size": 154880
}
