{
  "architectures": [
    "HYV3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "enable_attention_fp32_softmax": false,
  "enable_lm_head_fp32": true,
  "enable_moe_fp32_combine": false,
  "expert_hidden_dim": 1536,
  "first_k_dense_replace": 1,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.006,
  "intermediate_size": 13312,
  "max_position_embeddings": 262144,
  "model_type": "hy_v3",
  "moe_intermediate_size": 1536,
  "moe_router_enable_expert_bias": true,
  "moe_router_use_sigmoid": true,
  "num_attention_heads": 64,
  "num_experts": 192,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 4,
  "num_key_value_heads": 8,
  "num_nextn_predict_layers": 1,
  "num_shared_experts": 1,
  "output_router_logits": true,
  "qk_norm": true,
  "rms_norm_eps": 1e-05,
  "rope_parameters": {
    "rope_theta": 11158840.0,
    "rope_type": "default"
  },
  "route_norm": true,
  "router_scaling_factor": 2.826,
  "tie_word_embeddings": false,
  "use_cache": true,
  "use_grouped_mm": false,
  "vocab_size": 120832
}
