{
  "architectures": [
    "KimiK25ForConditionalGeneration"
  ],
  "auto_map": {
    "AutoConfig": "configuration_kimi_k25.KimiK25Config",
    "AutoModelForCausalLM": "modeling_kimi_k25.KimiK25ForConditionalGeneration"
  },
  "model_type": "kimi_k25",
  "text_config": {
    "architectures": [
      "DeepseekV3ForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "aux_loss_alpha": 0.001,
    "dtype": "bfloat16",
    "first_k_dense_replace": 1,
    "hidden_act": "silu",
    "hidden_size": 7168,
    "intermediate_size": 18432,
    "kv_lora_rank": 512,
    "max_position_embeddings": 262144,
    "model_type": "kimi_k2",
    "moe_intermediate_size": 2048,
    "moe_layer_freq": 1,
    "n_group": 1,
    "n_routed_experts": 384,
    "n_shared_experts": 1,
    "norm_topk_prob": true,
    "num_attention_heads": 64,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 4,
    "num_key_value_heads": 64,
    "q_lora_rank": 1536,
    "qk_nope_head_dim": 128,
    "qk_rope_head_dim": 64,
    "rms_norm_eps": 1e-05,
    "rope_scaling": {
      "beta_fast": 32.0,
      "beta_slow": 1.0,
      "factor": 64.0,
      "mscale": 1.0,
      "mscale_all_dim": 1.0,
      "original_max_position_embeddings": 4096,
      "type": "yarn"
    },
    "rope_theta": 50000.0,
    "routed_scaling_factor": 2.827,
    "scoring_func": "sigmoid",
    "seq_aux": true,
    "topk_group": 1,
    "topk_method": "noaux_tc",
    "v_head_dim": 128,
    "vocab_size": 163840
  },
  "use_unified_vision_chunk": true,
  "vision_config": {
    "_attn_implementation": "flash_attention_2",
    "merge_kernel_size": [
      2,
      2
    ],
    "merge_type": "sd2_tpool",
    "mm_hidden_size": 1152,
    "mm_projector_type": "patchmerger",
    "patch_size": 14,
    "text_hidden_size": 7168,
    "video_attn_type": "spatial_temporal",
    "vt_hidden_size": 1152,
    "vt_intermediate_size": 4304,
    "vt_num_attention_heads": 16,
    "vt_num_hidden_layers": 27
  }
}
