{
  "architectures": [
    "Llama4ForConditionalGeneration"
  ],
  "model_type": "llama4",
  "text_config": {
    "attention_dropout": 0.0,
    "hidden_act": "silu",
    "hidden_size": 5120,
    "interleave_moe_layer_step": 2,
    "intermediate_size": 8192,
    "intermediate_size_mlp": 16384,
    "max_position_embeddings": 1048576,
    "model_type": "llama4_text",
    "num_attention_heads": 40,
    "num_experts_per_tok": 1,
    "num_hidden_layers": 48,
    "num_key_value_heads": 8,
    "num_local_experts": 128,
    "no_rope_layers": [],
    "rms_norm_eps": 1e-05,
    "rope_theta": 500000.0,
    "vocab_size": 202048
  },
  "vision_config": {
    "hidden_size": 1408,
    "image_size": 448,
    "intermediate_size": 5632,
    "model_type": "llama4_vision",
    "num_attention_heads": 16,
    "num_hidden_layers": 34,
    "patch_size": 14
  }
}
