{
  "architectures": [
    "MiMoV2ForCausalLM"
  ],
  "attention_bias": false,
  "attention_chunk_size": 128,
  "attention_dropout": 0.0,
  "attention_projection_layout": "fused_qkv",
  "attention_value_scale": 0.707,
  "add_full_attention_sink_bias": false,
  "add_swa_attention_sink_bias": true,
  "audio_config": {
    "audio_channels": 20,
    "group_size": 4,
    "input_local_dim": 1024,
    "input_local_layers": 6,
    "input_local_intermediate_size": 4096,
    "out_hidden_size": 4096
  },
  "dtype": "bfloat16",
  "head_dim": 192,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "hybrid_layer_pattern": [
    0,
    1,
    1
  ],
  "intermediate_size": 16384,
  "layernorm_epsilon": 1e-05,
  "max_position_embeddings": 262144,
  "model_type": "mimo_v2",
  "moe_intermediate_size": 2048,
  "moe_layer_freq": [
    0,
    1,
    1
  ],
  "n_group": 1,
  "n_routed_experts": 256,
  "n_shared_experts": null,
  "norm_topk_prob": true,
  "num_attention_heads": 64,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 3,
  "num_key_value_heads": 4,
  "partial_rotary_factor": 0.334,
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "store_dtype": "fp8"
  },
  "rope_scaling": {
    "rope_type": "default",
    "type": "default"
  },
  "rope_theta": 5000000,
  "routed_scaling_factor": null,
  "scoring_func": "sigmoid",
  "sliding_window": 128,
  "sliding_window_size": 128,
  "swa_head_dim": 192,
  "swa_num_attention_heads": 64,
  "swa_num_key_value_heads": 8,
  "swa_rope_theta": 10000,
  "swa_v_head_dim": 128,
  "topk_group": 1,
  "topk_method": "noaux_tc",
  "v_head_dim": 128,
  "video_token_id": 151656,
  "vision_config": {
    "depth": 28,
    "fullatt_block_indexes": [
      0,
      9,
      18,
      27
    ],
    "hidden_act": "silu",
    "hidden_size": 1280,
    "intermediate_size": 4608,
    "num_heads": 32,
    "num_key_value_heads": 8,
    "out_hidden_size": 4096,
    "patch_size": 16,
    "spatial_merge_size": 2,
    "temporal_patch_size": 2,
    "use_sink": true,
    "visual_token_window_size": 64,
    "window_size": 128
  },
  "vision_model_type": "mimovl",
  "vocab_size": 152576
}
